<!DOCTYPE html>
<html lang="en">
 <head>
  <title>
   Griogair Labhruidh - Dail-Riada
  </title>
  <link href="../../style.css" rel="stylesheet"/>
 </head>
 <body>
  <p>
   <a href="../index.html">
    Celtic Lyrics Corner
   </a>
   &gt;
   <a href="../artists.html">
    Artists
   </a>
   &gt;
   <a href="../index.html">
    Griogair Labhruidh
   </a>
   &gt;
   <a href="dail">
    Dail-Riada
   </a>
   &gt;
  Dail-Riada
   <br/>
   <div align="center">
    <table id="head_t">
     <tr>
      <td id="lc">
       <img src="dail.jpg" width="100"/>
      </td>
      <td>
       <h3>
        Dail-Riada
       </h3>
      </td>
     </tr>
     <tr>
      <td id="lc">
       <u>
        <b>
         Appears On
        </b>
        :
       </u>
      </td>
      <td>
       Dail-Riada
      </td>
     </tr>
     <tr>
      <td id="lc">
       <u>
        <b>
         Language
        </b>
        :
       </u>
      </td>
      <td>
       G&agrave;idhlig
      </td>
     </tr>
    </table>
   </div>
   <table id="lyrics">
    <tr>
     <td>
      <b>
       <u>
        Lyrics:
       </u>
      </b>
     </td>
     <td>
      <b>
       <u>
        English Translation:
       </u>
      </b>
     </td>
    </tr>
    <tr>
     <td>
      Tha mo chridh'-sa a' seinn gu treun
     </td>
     <td>
      My heart sings out strongly
     </td>
    </tr>
    <tr>
     <td>
      Mu 'n t&igrave;r bu dual dhomh 's do chainnt na F&egrave;inn',
     </td>
     <td>
      of the beautiful land frequented by the Fingalians
     </td>
    </tr>
    <tr>
     <td>
      D&ugrave;thaich mhaiseach a rinn m'&agrave;rach;
     </td>
     <td>
      The gorgeous land from where I rose
     </td>
    </tr>
    <tr>
     <td>
      T&igrave;r nan s&agrave;r-laoch nam beanntan &agrave;rd.
     </td>
     <td>
      Land of the true highland heroes
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      Mi 'n seo nam chr&ugrave;ban 's mi cianail t&ugrave;rsach,
     </td>
     <td>
      I sit hunched over, saddened and tired
     </td>
    </tr>
    <tr>
     <td>
      Gun t&agrave;mh gun sunnd is mo shaoghal gun s&igrave;th,
     </td>
     <td>
      without rest or joy and my world without peace
     </td>
    </tr>
    <tr>
     <td>
      Cha b&agrave;s no buaireadh a dh&ugrave;isg mo smuaintean,
     </td>
     <td>
      'Tis not death or temptation that has awoken my thoughts
     </td>
    </tr>
    <tr>
     <td>
      Cha fuath nan cruinneag a bhuail mo chridh',
     </td>
     <td>
      'Tis not unrequited love that has struck my heart
     </td>
    </tr>
    <tr>
     <td>
      Ach 's e cr&agrave;idh mi &ndash; cionn-f&agrave;th mo l&egrave;iridh &ndash;
     </td>
     <td>
      But that which hurt me, the cause of my wounding -
     </td>
    </tr>
    <tr>
     <td>
      Ged theireadh c&agrave;ch gur cr&agrave;iteach mi;
     </td>
     <td>
      although most will say I am just bitter
     </td>
    </tr>
    <tr>
     <td>
      'S e s&igrave;ol na gr&agrave;isge chaidh an cur le Sasainn
     </td>
     <td>
      It is the seed of rabble that was planted from England
     </td>
    </tr>
    <tr>
     <td>
      An t&igrave;r na G&agrave;idhlig a ghleus mo str&igrave;.
     </td>
     <td>
      into the land of the Gaelic that has stirred my fight
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      'S gach &agrave;it' gan t&egrave;id mi tha m' chluas ag &egrave;isteachd
     </td>
     <td>
      In every place I go, my ears must listen
     </td>
    </tr>
    <tr>
     <td>
      Ri luchd na Beurla 'tha fantainn ann,
     </td>
     <td>
      to the non-Gaels who are living there,
     </td>
    </tr>
    <tr>
     <td>
      'S ged rug' mi fh&igrave;n ann an t&igrave;r tha &igrave;osal,
     </td>
     <td>
      and although I was born near the lowlands,
     </td>
    </tr>
    <tr>
     <td>
      Bu dual dham shinnsreadh t&igrave;r &agrave;rd nam beann,
     </td>
     <td>
      my people are from the high land of the mountains
     </td>
    </tr>
    <tr>
     <td>
      T&igrave;r eagach fhraochmhor, t&igrave;r lochach chraobhach,
     </td>
     <td>
      Land of sharp cliffs, land of lochs and trees,
     </td>
    </tr>
    <tr>
     <td>
      T&igrave;r nan laoch is nan cinneadh f&igrave;or;
     </td>
     <td>
      Land of heroes and clans,
     </td>
    </tr>
    <tr>
     <td>
      Mar bhroinn mo mh&agrave;thar chuir smior 'nam chn&agrave;mhan,
     </td>
     <td>
      Like my mothers womb that put marrow in my bones to me,
     </td>
    </tr>
    <tr>
     <td>
      Leam-s' tha 'n &agrave;rd-th&igrave;r nam flath san iar.
     </td>
     <td>
      is the high land of the heroes to the west
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      Ged thogadh fuath dhuibh an t&igrave;m a' chruadail,
     </td>
     <td>
      Although many mistreated you in times of hardship,
     </td>
    </tr>
    <tr>
     <td>
      'S gun deach thar chuain cuid dhe ur &agrave;l a bh'ann,
     </td>
     <td>
      and some of your young went over the seas,
     </td>
    </tr>
    <tr>
     <td>
      Tha cainnt mo luaidh-sa fo dh&igrave;onachd stuadhan
     </td>
     <td>
      the language I love still loves protected by the waves
     </td>
    </tr>
    <tr>
     <td>
      Nan eilean luachmhor, 's i fh&agrave;thast neo-ghann.
     </td>
     <td>
      of the precious islands and she is still not scarse
     </td>
    </tr>
    <tr>
     <td>
      Ach sheall nur l&egrave;irsinn ur laoigh gur tr&egrave;igsinn -
     </td>
     <td>
      But look in your vision, your young forsaking you -
     </td>
    </tr>
    <tr>
     <td>
      'S iad d&egrave;anamh r&egrave;iteach le n&agrave;mhaid cruaidh,
     </td>
     <td>
      Consorting with a sworn enemy,
     </td>
    </tr>
    <tr>
     <td>
      Mar chlann na h-&Egrave;ireann nach dean sibh &egrave;irigh?
     </td>
     <td>
      like the children of Ireland, will you not rise?
     </td>
    </tr>
    <tr>
     <td>
      Ur airm gan gleusadh le beul an t-sluaigh.
     </td>
     <td>
      Your arms being the opinion of your people!
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      'S e bu dual dhuibh an dream bha buadhmhor,
     </td>
     <td>
      your natives are the race which won virtue,
     </td>
    </tr>
    <tr>
     <td>
      A chosg dhuinn cli&ugrave; thar gach sluaigh fon ghr&egrave;in',
     </td>
     <td>
      who won u a reputation above all others,
     </td>
    </tr>
    <tr>
     <td>
      'S iad air an sti&ugrave;ireadh le daoine fuadain
     </td>
     <td>
      controlled by the foreigners,
     </td>
    </tr>
    <tr>
     <td>
      'S an cainnt ga sgi&ugrave;rsadh le gn&agrave;thsan c&egrave;in',
     </td>
     <td>
      their language is driven out with foreign ways
     </td>
    </tr>
    <tr>
     <td>
      Ach 's e mo dh&ugrave;rachd gun dean sinn d&ugrave;sgadh
     </td>
     <td>
      But my wish is that we will wake up -
     </td>
    </tr>
    <tr>
     <td>
      'S gun t&egrave;id arc &ugrave;l ris na f&agrave;sain &ugrave;r',
     </td>
     <td>
      and put our backs to the new fashions;
     </td>
    </tr>
    <tr>
     <td>
      'S gun &egrave;irich suim dha ar dualchas uasal &ndash;
     </td>
     <td>
      That respect will arise for our noble culture
     </td>
    </tr>
    <tr>
     <td>
      'S gun gabh gu h-uaibhreach ar sliochd an sti&ugrave;ir!
     </td>
     <td>
      that our people will proudly take control!
     </td>
    </tr>
   </table>
   <cleaned>
   </cleaned>
  </p>
 </body>
</html>
