<html>
 <!-- Mirrored from www.celticlyricscorner.net/compilations/anbinsin.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 01 Mar 2021 20:05:42 GMT -->
 <head>
  <title>
   Gaelic Ireland - An Bins&iacute;n Luachra
  </title>
  <link href="../../style.css" rel="stylesheet"/>
 </head>
 <body>
  <p align="left">
   <a href="../index.html">
    Celtic Lyrics Corner
   </a>
   &gt;
   <a href="index.html">
    Compilations
   </a>
   &gt;
   <a href="../index.html">
    Gaelic Ireland
   </a>
   &gt; An Bins&iacute;n Luachra
  </p>
  <p align="center">
   <div align="center">
    <table id="head_t">
     <tr>
      <td id="lc">
       &nbsp;
      </td>
      <td>
       &nbsp;
      </td>
     </tr>
     <tr>
      <td id="lc">
       <img alt="Gaelic Ireland" src="gaelicireland.jpg"/>
      </td>
      <td>
       An Bins&iacute;n Luachra
      </td>
     </tr>
     <tr>
      <td id="lc">
       &nbsp;
      </td>
      <td>
       &nbsp;
      </td>
     </tr>
     <tr>
      <td id="lc">
       <b>
        <u>
         Credits
        </u>
        :
       </b>
      </td>
      <td>
       n/a
      </td>
     </tr>
     <tr>
      <td id="lc">
       &nbsp;
      </td>
      <td>
       &nbsp;
      </td>
     </tr>
     <tr>
      <td id="lc">
       <b>
        <u>
         Appears On
        </u>
        :
       </b>
      </td>
      <td>
       <a href="gaelicireland.html">
        Gaelic Ireland
       </a>
       (compilation)
      </td>
     </tr>
     <tr>
      <td id="lc">
       &nbsp;
      </td>
      <td>
       &nbsp;
      </td>
     </tr>
     <tr>
      <td id="lc">
       <b>
        <u>
         Language
        </u>
        :
       </b>
      </td>
      <td>
       Gaeilge (Irish Gaelic)
      </td>
     </tr>
     <tr>
      <td id="lc">
       &nbsp;
      </td>
      <td>
       &nbsp;
      </td>
     </tr>
    </table>
   </div>
  </p>
  <div align="center">
   <table id="lyrics">
    <tr>
     <td>
      <b>
       <u>
        Lyrics
       </u>
       :
      </b>
     </td>
     <td>
      <b>
       <u>
        English Translation
       </u>
       :
      </b>
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      Is ar an ngasra &uacute;d ath&aacute; ceangailte
     </td>
     <td>
      And on the band that's near you
     </td>
    </tr>
    <tr>
     <td>
      Go dl&uacute;th le d'thaobh
     </td>
     <td>
      Never leaving you close by your side
     </td>
    </tr>
    <tr>
     <td>
      Mar sibh do dhearbhaigh i l&aacute;thair Choisdealaigh
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Ar an tri&uacute;r fear s&eacute;imh
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Is a chuir na Connerys thar na farraig&iacute;
     </td>
     <td>
      And sent the Connerys across the raging seas
     </td>
    </tr>
    <tr>
     <td>
      Go dt&iacute; sna New South Wales
     </td>
     <td>
      To New South Wales
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      T&eacute; a bheadh ina sheasamh ann
     </td>
     <td>
      He who was standing doing his thinking
     </td>
    </tr>
    <tr>
     <td>
      Is dh&eacute;anfadh machnamh ar &aacute;r gc&uacute;is d&aacute; pl&eacute;
     </td>
     <td>
      Clear on our case being tried
     </td>
    </tr>
    <tr>
     <td>
      Mar a sheasaigh s&iacute; &oacute;n seacht ar maid&iacute;n
     </td>
     <td>
      From early seven morn until the day was done
     </td>
    </tr>
    <tr>
     <td>
      Go dt&iacute; tar &eacute;is a naoi
     </td>
     <td>
      Truth was defied
     </td>
    </tr>
    <tr>
     <td>
      Do chroith an talamh f&uacute;inn le linn na leabhartha
     </td>
     <td>
      The ground shook under us as lies came thunderous
     </td>
    </tr>
    <tr>
     <td>
      Ann d&aacute; dtabhairt sa mbr&eacute;ag
     </td>
     <td>
      To decide our fate
     </td>
    </tr>
    <tr>
     <td>
      Mo ghreidhin an t-anam bocht
     </td>
     <td>
      I fear the perjured soul is in the darkest hole
     </td>
    </tr>
    <tr>
     <td>
      N&oacute; t&aacute; s&iacute; damanta m&aacute;'s f&iacute;or don chl&eacute;ir
     </td>
     <td>
      So the holy clergy say
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      T&aacute; jac&eacute;id d&aacute; dh&eacute;anamh &oacute; mhaidin d&uacute;inn
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Is tri&uacute;s d&aacute; r&eacute;ir
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Culaithe farrag&iacute;, n&iacute; n&aacute;r thaithigheamar
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      I dt&uacute;is &aacute;r saoil
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Muireach feabhas &aacute;r gcaradais bh&iacute; &aacute;r muin&iacute;l cnagtha
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      Is sinn go doimhin san aol
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      N&oacute; gur casadh sinn chun t&eacute;arma&iacute; a chaitheadh
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      I sna New South Wales
     </td>
     <td>
      ___
     </td>
    </tr>
    <tr>
     <td>
      &nbsp;
     </td>
     <td>
      &nbsp;
     </td>
    </tr>
    <tr>
     <td>
      A Bhanr&iacute;on bheannaithe is a R&iacute; na bhFlaitheas Geal
     </td>
     <td>
      Queen of Heaven and King of all worlds
     </td>
    </tr>
    <tr>
     <td>
      Den tr&oacute;caire orainn araon
     </td>
     <td>
      Might beg release for us all
     </td>
    </tr>
    <tr>
     <td>
      Is ar an mbanaltra at&aacute; sa bhaile
     </td>
     <td>
      And for our sister young alone now in her home
     </td>
    </tr>
    <tr>
     <td>
      Go d&uacute;ch in&aacute;r nd&eacute;idh
     </td>
     <td>
      With her child so small
     </td>
    </tr>
    <tr>
     <td>
      Le linn an Aifrinn b&iacute;g&iacute; ag agallamh
     </td>
     <td>
      When mass you're reading be you pleading
     </td>
    </tr>
    <tr>
     <td>
      Is ag gu&iacute; chun D&eacute;
     </td>
     <td>
      That our courage won't fail
     </td>
    </tr>
    <tr>
     <td>
      Leis na Connerys a thabhairt abhaile chughainn
     </td>
     <td>
      The Connerys to come safe in honor
     </td>
    </tr>
    <tr>
     <td>
      &Oacute; sna New South Wales
     </td>
     <td>
      Home from New South Wales
     </td>
    </tr>
   </table>
  </div>
  <cleaned>
  </cleaned>
 </body>
 <!-- Mirrored from www.celticlyricscorner.net/compilations/anbinsin.htm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 01 Mar 2021 20:05:42 GMT -->
</html>
Bh&iacute;os-sa maidin Shamhraidh ag g&oacute;ilt s&iacute;os tr&iacute; Chontae an Chl&aacute;ir,
Agus &eacute;anlaith coille ag labhairt liom ar an gcrann is iad ag si&uacute;inse&aacute;il,
Sea do casadh liomsa an ansacht ba bhre&aacute;tha is ba dheise snua,
'Gus thugas searc is greann di, 'dtaobh 'amhrais 's&iacute; bl&aacute;th na n-&uacute;ll.

Maidin aoibhinn uaibhreach ar bhruach na coille glaise bre&aacute;,
Is mo ghadhair le m'ais ag gluaiseacht go huasal is mo ghunna im' l&aacute;imh,
'Sea do dhearcas chughamsa stuair&iacute;n na gruaige finne 's an bhrollaigh bh&aacute;in,
Agus &aacute;bhar ' bhinse buainte aici den luachair ba ghlaise f&aacute;s.

'S do dh'fh&eacute;achas ar na cuanta agus bh&iacute; ann uaigneas agam ar n&oacute;in,
Is do dhruideas suas lem' stuair&iacute;n agus fuaireas uaithi c&uacute;pla p&oacute;g,
Ach 's&eacute; d&uacute;irt s&iacute; liom go huaibhreach 'Fan suanmhar is n&aacute; cuir orm str&oacute;,
'Gus n&aacute; scaip mo bhinse luachra t'r &eacute;is a bhfuaireas d&aacute; thriobl&oacute;id'.

Is a chail&iacute;n bhig na luachra, d&aacute; leagf&aacute;sa do bheart ar l&aacute;r,
Ar bhruach na coille craobha&iacute; n&oacute; ag &eacute;isteacht le fuaim na tr&aacute;,
Mar na sagairt n&iacute; bhfaighidh sc&eacute;al' air n&aacute; &eacute;inne eile d&aacute; bhfuil san &aacute;it,
N&oacute; go dtiocfaidh an chaint don ch&eacute;irseach 's go n-iomp&oacute;idh an lon dubh b&aacute;n.

&Oacute; cail&iacute;n deas ab fhearr liom a bheith ar l&aacute;imh liom thar a bhfeaca&iacute;os riamh,
'Gus d&aacute; bp&oacute;sfainn cailleach ghr&aacute;nna mo l&aacute;nchreach n&aacute; mairfinn bliain,
Ach ph&oacute;sfainn thusa, a ghr&aacute; ghil, a ch&uacute;il f&aacute;inneach na dtriopla&iacute; siar,
Is do bhainfinnse binse bre&aacute; duit chomh h&aacute;lainn is a chonaic t&uacute; ariamh.

Is a chail&iacute;n bhig na luachra glac suaimhneas agus fan go r&eacute;idh,
Mar n&iacute; c&aacute;s duit a bheith chomh buartha in uaigneas is t&uacute; leat f&eacute;in,
Mar m&aacute; scaip m&eacute; do chuid luachra nach dual go bhfuil m&oacute;rchuid tar a &eacute;is,
Agus bainfeadsa binse m&oacute;r duit agus ualach mar thuilleadh l&eacute;i.

Is ba dheas an cail&iacute;n seomra &iacute; um thr&aacute;thn&oacute;na is a bruis 'na l&aacute;imh,
Is c&aacute;r dheise n&aacute; cr&uacute; na mb&oacute; &iacute; 's&iacute; sm&oacute;il&iacute;n &iacute; an bhrollaigh bh&aacute;in,
Do tharraingeodh sampla&iacute; cor&oacute;inneach go r&oacute;bhre&aacute; ar &eacute;adach cl&aacute;ir,
'S&iacute; searc mo chro&iacute; 's mo r&uacute;n &iacute; 's&iacute; mo stuair&iacute;n &iacute; go bhfaighidh m&eacute; b&aacute;s.
